app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @side_bar = true
    @articles = Article.all

INSERT INTO `articles` (`updated_at`, `photo_file_name`, `photo_file_size`, `title`, `body`, `date`, `isShare`, `photo_updated_at`, `photo_content_type`, `user_id`, `created_at`) VALUES('2010-04-07 00:22:24', '_.jpg', 715734, 'asfaf', '<p>asfdasdaf</p>', '2010-04-07 00:22:23', 0, '2010-04-07 00:22:24', 'image/jpeg', 2, '2010-04-07 00:22:24')
---
  def create

    if params[:article][:isShare] == "1"
      params[:article][:isShare] = true
    else
      params[:article][:isShare] = false
    end
    #    @article = Article.new(params[:article])
    #    @article = Article.new({:writer=>current_user.login,  :date =>Time.now }.merge(params[:article]))
    @article = Article.new({:date =>Time.now }.merge(params[:article]))
    @article.user = current_user
    respond_to do |format|
      if @article.save

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
UPDATE `articles` SET `updated_at` = '2010-03-30 13:36:36', `date` = '2010-03-30 13:36:36', `body` = '<p>asdfasdfasdfasdasdfasdfasd</p>' WHERE `id` = 2
---
  def update

    if params[:article][:isShare] == "1"
      params[:article][:isShare] = true
    else
      params[:article][:isShare] = false
    end
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes({:date =>Time.now }.merge(params[:article]))