app/controllers/comments_controller.rb

SELECT * FROM `articles` WHERE (`articles`.`id` = 2)
---
  def find_article
    @article_id = params[:article_id]
    @article = Article.find(@article_id)

INSERT INTO `comments` (`created_at`, `photo_file_size`, `body`, `updated_at`, `photo_file_name`, `photo_content_type`, `user_id`, `article_id`, `photo_updated_at`) VALUES('2010-03-30 13:39:24', NULL, 'asdfsadfasdf', '2010-03-30 13:39:24', NULL, NULL, 2, 2, NULL)
---
  def create
    @comment = Comment.new({:updated_at =>Time.now }.merge(params[:comment]))
    @comment.user = current_user
    @comment.article = @article

    respond_to do |format|
      if @comment.save