app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages`

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`created_at`, `body`, `updated_at`) VALUES('2010-03-30 14:29:44', 'asdasdfsa', '2010-03-30 14:29:44')

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 3)
UPDATE `pages` SET `updated_at` = '2010-03-30 14:37:24', `body` = 'adasdfasdfasdad' WHERE `id` = 3

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
DELETE FROM `pages` WHERE `id` = 1