app/controllers/pagecontents_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`id` = 4)
---
  def find_page
    @page_id = params[:page_id]
    @page = Page.find(@page_id)

SELECT * FROM `pagecontents` WHERE (`pagecontents`.`id` = 5 AND (`pagecontents`.page_id = 4))
---
  def edit
    @pagecontent = @page.pagecontents.find(params[:id])

SELECT * FROM `pagecontents` WHERE (`pagecontents`.page_id = 4)
SELECT * FROM `pages`
INSERT INTO `pagecontents` (`created_at`, `body`, `updated_at`, `page_id`) VALUES('2010-03-30 15:02:19', 'asdfasdf', '2010-03-30 15:02:19', 4)
---
  def create
    @pagecontent = Pagecontent.new(params[:pagecontent])
    @pagecontent.page = @page

    respond_to do |format|
      if @pagecontent.save

SELECT * FROM `pagecontents` WHERE (`pagecontents`.`id` = 5 AND (`pagecontents`.page_id = 4))
UPDATE `pagecontents` SET `updated_at` = '2010-03-30 15:17:19', `body` = 'asdfasdf34334' WHERE `id` = 5
---
  def update
    @pagecontent = @page.pagecontents.find(params[:id])

    respond_to do |format|
      if @pagecontent.update_attributes(params[:pagecontent])

SELECT * FROM `pagecontents` WHERE (`pagecontents`.`id` = 3 AND (`pagecontents`.page_id = 4))
DELETE FROM `pagecontents` WHERE `id` = 1
---
  def destroy
    @pagecontent = @page.pagecontents.find(params[:id])
    @pagecontent.destroy