app/controllers/users_controller.rb

  def index
    @user = User.find(:all, :conditions => "login != 'admin'")
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_login_at`, `updated_at`, `last_request_at`, `crypted_password`, `current_login_ip`, `password_salt`, `current_login_at`, `isAdmin`, `persistence_token`, `login_count`, `login`, `created_at`, `last_login_ip`) VALUES(NULL, '2010-04-07 00:05:20', '2010-04-07 00:05:20', '45c4fc91a72525248e38f27b99ca0fd77c5be55d8892c408e1f55c58506dc81de8877a8adb98ad5901fb906f8294e3c6ac55c9391c48816dda18b9cc6be4ab49', '127.0.0.1', 'MyopP6AbNA2C9d_SCIxN', '2010-04-07 00:05:20', 0, '577c4750b772a49ccf881bd5e56fcc6458de501497c5b706b52dfffbb2897368216e47c845a517385db7d44a8318d256d1bc53c61799b1b4c0790f0e9ea7b0d2', 1, 'admin', '2010-04-07 00:05:20', NULL)

  def change
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def confirm
    @user = User.find(params[:id])
    if params[:user][:isAdmin] == "1"
      params[:user][:isAdmin] = true
    else
      params[:user][:isAdmin] = false
    end

    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-03-30 13:03:51', `last_request_at` = '2010-03-30 13:03:51' WHERE `id` = 1